# Installed with: brew bundle --file=Brewfile
# https://github.com/Homebrew/homebrew-bundle

tap 'nikitabobko/tap'      # AeroSpace
tap 'FelixKratz/formulae'  # SketchyBar

brew 'FelixKratz/formulae/sketchybar', trusted: true
brew 'FelixKratz/formulae/borders', trusted: true
cask 'nikitabobko/tap/aerospace', trusted: true

brew 'oven-sh/bun/bun', trusted: true

# ---- Terminal -------------------------------------------------------------------
cask 'ghostty'
cask 'visual-studio-code'
cask 'docker-desktop'
cask 'raycast'
cask 'font-jetbrains-mono-nerd-font'

# ---- Core CLI tools ---------------------------------------------------------------
brew 'git'
brew 'gh'
brew 'neovim'
brew 'zsh'
brew 'tmux'
brew 'ripgrep'
brew 'fd'
brew 'fzf'
brew 'lazygit'
brew 'direnv'

# ---- Language toolchains referenced by LazyVim extras -----------------------------
brew 'lua-language-server'

# ---- Language runtimes ------------------------------------------------------------
brew 'node'
brew 'rust'
brew 'oven-sh/bun/bun'
brew 'pnpm'
brew 'libpq'
